khoih-prog/ESP_AT_WM_Lite/src/Esp8266_AT_WM_Lite_Mbed_RPi_Pico.h
const char ESP_AT_HTML_HEAD_STYLE[] /*PROGMEM*/ =
  "<style>div,input{padding:5px;font-size:1em;}input{width:95%;}body{text-align: center;}button{background-color:#16A1E7;color:#fff;line-height:2.4rem;font-size:1.2rem;width:100%;}fieldset{border-radius:0.3rem;margin:0px;}</style>";

#if USING_BOARD_NAME
  const char ESP_AT_HTML_HEAD_END[]   /*PROGMEM*/ =
  "</head><div style='text-align:left;display:inline-block;min-width:260px;'>\
  <fieldset><div><label>*WiFi SSID</label><div>[[input_id]]</div></div>\
  <div><label>*PWD (8+ chars)</label><input value='[[pw]]' id='pw'><div></div></div>\
  <div><label>*WiFi SSID1</label><div>[[input_id1]]</div></div>\
  <div><label>*PWD1 (8+ chars)</label><input value='[[pw1]]' id='pw1'><div></div></div></fieldset>\
  <fieldset><div><label>Board Name</label><input value='[[nm]]' id='nm'><div></div></div></fieldset>";	// DO NOT CHANGE THIS STRING EVER!!!!
#else
  const char ESP_AT_HTML_HEAD_END[]   /*PROGMEM*/ =
  "</head><div style='text-align:left;display:inline-block;min-width:260px;'>\
  <fieldset><div><label>*WiFi SSID</label><div>[[input_id]]</div></div>\
  <div><label>*PWD (8+ chars)</label><input value='[[pw]]' id='pw'><div></div></div>\
  <div><label>*WiFi SSID1</label><div>[[input_id1]]</div></div>\
  <div><label>*PWD1 (8+ chars)</label><input value='[[pw1]]' id='pw1'><div></div></div></fieldset>";	// DO NOT CHANGE THIS STRING EVER!!!!
#endif

const char ESP_AT_HTML_INPUT_ID[]   /*PROGMEM*/ = "<input value='[[id]]' id='id'>";
const char ESP_AT_HTML_INPUT_ID1[]  /*PROGMEM*/ = "<input value='[[id1]]' id='id1'>";

const char ESP_AT_FLDSET_START[]  /*PROGMEM*/ = "<fieldset>";
const char ESP_AT_FLDSET_END[]    /*PROGMEM*/ = "</fieldset>";
const char ESP_AT_HTML_PARAM[]    /*PROGMEM*/ =
  "<div><label>{b}</label><input value='[[{v}]]'id='{i}'><div></div></div>";
const char ESP_AT_HTML_BUTTON[]   /*PROGMEM*/ = "<button onclick='sv()'>Save</button></div>";

#if USING_BOARD_NAME
  const char ESP_AT_HTML_SCRIPT[]   /*PROGMEM*/ = "<script id=\"jsbin-javascript\">\
  function udVal(key,val){var request=new XMLHttpRequest();var url='/?key='+key+'&value='+encodeURIComponent(val);\
  request.open('GET',url,false);request.send(null);}\
  function sv(){udVal('id',document.getElementById('id').value);udVal('pw',document.getElementById('pw').value);\
  udVal('id1',document.getElementById('id1').value);udVal('pw1',document.getElementById('pw1').value);\
  udVal('nm',document.getElementById('nm').value);";
#else
  const char ESP_AT_HTML_SCRIPT[]   /*PROGMEM*/ = "<script id=\"jsbin-javascript\">\
  function udVal(key,val){var request=new XMLHttpRequest();var url='/?key='+key+'&value='+encodeURIComponent(val);\
  request.open('GET',url,false);request.send(null);}\
  function sv(){udVal('id',document.getElementById('id').value);udVal('pw',document.getElementById('pw').value);\
  udVal('id1',document.getElementById('id1').value);udVal('pw1',document.getElementById('pw1').value);";
#endif

const char ESP_AT_HTML_SCRIPT_ITEM[]  /*PROGMEM*/ = "udVal('{d}',document.getElementById('{d}').value);";
const char ESP_AT_HTML_SCRIPT_END[]   /*PROGMEM*/ = "alert('Updated');}</script>";
const char ESP_AT_HTML_END[]          /*PROGMEM*/ = "</html>";

#if SCAN_WIFI_NETWORKS
  const char WM_SELECT_START[]      /*PROGMEM*/ = "<select id=";
  const char WM_SELECT_END[]        /*PROGMEM*/ = "</select>";
  const char WM_DATALIST_START[]    /*PROGMEM*/ = "<datalist id=";
  const char WM_DATALIST_END[]      /*PROGMEM*/ = "</datalist>";
  const char WM_OPTION_START[]      /*PROGMEM*/ = "<option>";
  const char WM_OPTION_END[]        /*PROGMEM*/ = "";     // "</option>"; is not required
  const char WM_NO_NETWORKS_FOUND[] /*PROGMEM*/ = "No suitable WiFi networks available!";
#endif

//////////////////////////////////////////

//KH Add repeatedly used const
//KH, from v1.1.0
const char WM_HTTP_HEAD_CL[]         PROGMEM = "Content-Length";
const char WM_HTTP_HEAD_TEXT_HTML[]  PROGMEM = "text/html";
const char WM_HTTP_HEAD_TEXT_PLAIN[] PROGMEM = "text/plain";

const char WM_HTTP_CACHE_CONTROL[]   PROGMEM = "Cache-Control";
const char WM_HTTP_NO_STORE[]        PROGMEM = "no-cache, no-store, must-revalidate";
const char WM_HTTP_PRAGMA[]          PROGMEM = "Pragma";
const char WM_HTTP_NO_CACHE[]        PROGMEM = "no-cache";
const char WM_HTTP_EXPIRES[]         PROGMEM = "Expires";

const char WM_HTTP_CORS[]            PROGMEM = "Access-Control-Allow-Origin";
const char WM_HTTP_CORS_ALLOW_ALL[]  PROGMEM = "*";

//////////////////////////////////////////////

// New from v1.1.0
#if !defined(REQUIRE_ONE_SET_SSID_PW)
  #define REQUIRE_ONE_SET_SSID_PW     false
#endif

#define PASSWORD_MIN_LEN        8

//////////////////////////////////////////////

String IPAddressToString(const IPAddress& _address)
{
  String str = String(_address[0]);
  str += ".";
  str += String(_address[1]);
  str += ".";
  str += String(_address[2]);
  str += ".";
  str += String(_address[3]);
  return str;
}

//////////////////////////////////////////////

class ESP_AT_WiFiManager_Lite
{
  public:

    ESP_AT_WiFiManager_Lite(Stream* espSerial, uint32_t speed = 115200)
    {
      (void) speed;

      WiFi.init(espSerial);

      // check for the presence of the shield
      if (WiFi.status() == WL_NO_SHIELD)
      {
        ESP_AT_LOGDEBUG(F("NoESP"));
      }

      //WiFi.reset();
    }

    //////////////////////////////////////////////

    ~ESP_AT_WiFiManager_Lite()
    {
      if (server)
      {
        delete server;

#if SCAN_WIFI_NETWORKS

        if (indices)
        {
          free(indices); //indices array no longer required so free memory
        }

#endif
      }
    }

    //////////////////////////////////////////////

    bool connectWiFi(const char* ssid, const char* pass)
    {
      ESP_AT_LOGDEBUG1(F("Con2:"), ssid);

      if ( WiFi.begin(ssid, pass) )
      {
        displayWiFiData();
      }
      else
      {
        ESP_AT_LOGDEBUG(F("NoW"));
        return false;
      }

      ESP_AT_LOGDEBUG(F("WOK"));

      wifi_connected = true;

