khoih-prog/ESP_AT_WM_Lite/src/Esp8266_AT_WM_Lite_Mbed_RPi_Pico.h
  private:
    String ipAddress = "0.0.0.0";

    ESP8266_AT_WebServer* server = NULL;
    bool configuration_mode = false;

    unsigned long configTimeout;
    bool hadConfigData = false;

    ESP8266_AT_Configuration ESP8266_AT_config;

    uint16_t totalDataSize = 0;

    String macAddress = "";
    bool wifi_connected = false;

    IPAddress portal_apIP = IPAddress(192, 168, 4, 1);

    // default to channel 1
    int AP_channel = 1;

    String portal_ssid = "";
    String portal_pass = "";

    IPAddress static_IP   = IPAddress(0, 0, 0, 0);

    /////////////////////////////////////

    // Add customs headers from v1.2.0

#if USING_CUSTOMS_STYLE
    const char* ESP_AT_HTML_HEAD_CUSTOMS_STYLE = NULL;
#endif

#if USING_CUSTOMS_HEAD_ELEMENT
    const char* _CustomsHeadElement = NULL;
#endif

#if USING_CORS_FEATURE
    const char* _CORS_Header        = WM_HTTP_CORS_ALLOW_ALL;   //"*";
#endif

    /////////////////////////////////////
    // Add WiFi Scan from v1.2.0

#if SCAN_WIFI_NETWORKS
    int WiFiNetworksFound = 0;    // Number of SSIDs found by WiFi scan, including low quality and duplicates
    int *indices;                 // WiFi network data, filled by scan (SSID, BSSID)
    String ListOfSSIDs = "";      // List of SSIDs found by scan, in HTML <option> format
#endif

    //////////////////////////////////////

    void displayConfigData(const ESP8266_AT_Configuration& configData)
    {
      ESP_AT_LOGDEBUG5(F("Hdr="),   configData.header, F(",SSID="), configData.WiFi_Creds[0].wifi_ssid,
                       F(",PW="),   configData.WiFi_Creds[0].wifi_pw);
      ESP_AT_LOGDEBUG3(F("SSID1="), configData.WiFi_Creds[1].wifi_ssid, F(",PW1="),  configData.WiFi_Creds[1].wifi_pw);
      ESP_AT_LOGDEBUG1(F("BName="), configData.board_name);

#if USE_DYNAMIC_PARAMETERS

      for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        ESP_AT_LOGERROR5("i=", i, ",id=", myMenuItems[i].id, ",data=", myMenuItems[i].pdata);
      }

#endif
    }

    //////////////////////////////////////////////

    void displayWiFiData()
    {
      ESP_AT_LOGDEBUG1(F("IP="), localIP() );
    }

    //////////////////////////////////////////////

#if USE_ESP32_AT
#define ESP_AT_BOARD_TYPE   "SHD_ESP32"
#else
#define ESP_AT_BOARD_TYPE   "SHD_ESP8266"
#endif

#define WM_NO_CONFIG        "blank"

    //////////////////////////////////////////////

    int calcChecksum()
    {
      int checkSum = 0;

      for (uint16_t index = 0; index < (sizeof(ESP8266_AT_config) - sizeof(ESP8266_AT_config.checkSum)); index++)
      {
        checkSum += * ( ( (byte*) &ESP8266_AT_config ) + index);
      }

      return checkSum;
    }

    //////////////////////////////////////////////

    // Use LittleFS/InternalFS for RPi_Pico
#define  CONFIG_FILENAME              ("/fs/wm_config.dat")
#define  CONFIG_FILENAME_BACKUP       ("/fs/wm_config.bak")

#define  CREDENTIALS_FILENAME         ("/fs/wm_cred.dat")
#define  CREDENTIALS_FILENAME_BACKUP  ("/fs/wm_cred.bak")

    //////////////////////////////////////////////

#if USE_DYNAMIC_PARAMETERS

    bool checkDynamicData()
    {
      int checkSum = 0;
      int readCheckSum;
      char * readBuffer = nullptr;

      // file existed
      FILE *file = fopen(CREDENTIALS_FILENAME, "r");

      ESP_AT_LOGDEBUG(F("LoadCredFile "));

      if (!file)
      {
        ESP_AT_LOGDEBUG(F("failed"));

        // Trying open redundant config file
        file = fopen(CREDENTIALS_FILENAME_BACKUP, "r");

        ESP_AT_LOGDEBUG(F("LoadBkUpCredFile "));

        if (!file)
        {
          ESP_AT_LOGDEBUG(F("failed"));
          return false;
        }
      }

      // Find the longest pdata, then dynamically allocate buffer. Remember to free when done
      // This is used to store tempo data to calculate checksum to see of data is valid
      // We dont like to destroy myMenuItems[i].pdata with invalid data

      uint16_t maxBufferLength = 0;

      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        if (myMenuItems[i].maxlen > maxBufferLength)
          maxBufferLength = myMenuItems[i].maxlen;
      }

      if (maxBufferLength > 0)
      {
        readBuffer = new char[ maxBufferLength + 1 ];

        // check to see NULL => stop and return false
        if (readBuffer == nullptr)
        {
          ESP_AT_LOGDEBUG(F("ChkCrR: Error can't allocate buffer."));
          return false;
        }
        else
        {
          ESP_AT_LOGDEBUG1(F("ChkCrR: Buffer allocated, Sz="), maxBufferLength + 1);
        }

        uint16_t offset = 0;

        for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
        {
          uint8_t * _pointer = (uint8_t *) readBuffer;

          // Actual size of pdata is [maxlen + 1]
          memset(readBuffer, 0, myMenuItems[i].maxlen + 1);

          // Redundant, but to be sure correct position
          fseek(file, offset, SEEK_SET);
          fread(_pointer, 1, myMenuItems[i].maxlen, file);

          offset += myMenuItems[i].maxlen;

          ESP_AT_LOGDEBUG3(F("ChkCrR:pdata="), readBuffer, F(",len="), myMenuItems[i].maxlen);

          for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++, _pointer++)
          {
            checkSum += *_pointer;
          }
        }

        fread((uint8_t *) &readCheckSum, 1, sizeof(readCheckSum), file);
        fclose(file);

        ESP_AT_LOGDEBUG(F("OK"));

        totalDataSize = sizeof(ESP8266_AT_config) + sizeof(readCheckSum) + offset;

        ESP_AT_LOGDEBUG3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));

        // Free buffer
        if (readBuffer != nullptr)
        {
          // Free buffer
          delete [] readBuffer;
          ESP_AT_LOGDEBUG(F("Buffer freed"));
        }

        if ( checkSum == readCheckSum)
        {
          return true;
        }
      }

      return false;
    }

    //////////////////////////////////////////////

    bool loadDynamicData()
    {
      int checkSum = 0;
      int readCheckSum;

      // file existed
      FILE *file = fopen(CREDENTIALS_FILENAME, "r");

