khoih-prog/ESP_AT_WM_Lite/src/Esp8266_AT_WM_Lite_Mbed_RPi_Pico.h
      ESP_AT_LOGDEBUG(F("LoadCredFile "));

      if (!file)
      {
        ESP_AT_LOGDEBUG(F("failed"));

        // Trying open redundant config file
        file = fopen(CREDENTIALS_FILENAME_BACKUP, "r");

        ESP_AT_LOGDEBUG(F("LoadBkUpCredFile "));

        if (!file)
        {
          ESP_AT_LOGDEBUG(F("failed"));
          return false;
        }
      }

      uint16_t offset = 0;

      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        uint8_t * _pointer = (uint8_t *) myMenuItems[i].pdata;

        // Actual size of pdata is [maxlen + 1]
        memset(myMenuItems[i].pdata, 0, myMenuItems[i].maxlen + 1);

        // Redundant, but to be sure correct position
        fseek(file, offset, SEEK_SET);
        fread(_pointer, 1, myMenuItems[i].maxlen, file);

        offset += myMenuItems[i].maxlen;

        ESP_AT_LOGDEBUG3(F("CrR:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);

        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++, _pointer++)
        {
          checkSum += *_pointer;
        }
      }

      fread((uint8_t *) &readCheckSum, 1, sizeof(readCheckSum), file);
      fclose(file);

      totalDataSize = sizeof(ESP8266_AT_config) + sizeof(readCheckSum) + offset;

      ESP_AT_LOGDEBUG(F("OK"));

      ESP_AT_LOGDEBUG3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));

      if ( checkSum != readCheckSum)
      {
        return false;
      }

      return true;
    }

    //////////////////////////////////////////////

    void saveDynamicData()
    {
      int checkSum = 0;

      // file existed
      FILE *file = fopen(CREDENTIALS_FILENAME, "w");

      ESP_AT_LOGDEBUG(F("SaveCredFile "));

      uint16_t offset = 0;

      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        uint8_t* _pointer = (uint8_t *) myMenuItems[i].pdata;

        ESP_AT_LOGDEBUG3(F("CW1:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);

        if (file)
        {
          // Redundant, but to be sure correct position
          fseek(file, offset, SEEK_SET);
          fwrite(_pointer, 1, myMenuItems[i].maxlen, file);

          offset += myMenuItems[i].maxlen;
        }
        else
        {
          ESP_AT_LOGDEBUG(F("failed"));
        }

        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++, _pointer++)
        {
          checkSum += *_pointer;
        }
      }

      if (file)
      {
        fwrite((uint8_t *) &checkSum, 1, sizeof(checkSum), file);
        fclose(file);

        ESP_AT_LOGDEBUG(F("OK"));
      }
      else
      {
        ESP_AT_LOGDEBUG(F("failed"));
      }

      ESP_AT_LOGDEBUG1(F("CrWCSum=0x"), String(checkSum, HEX));

      // Trying open redundant Auth file
      file = fopen(CREDENTIALS_FILENAME_BACKUP, "w");

      ESP_AT_LOGDEBUG(F("SaveBkUpCredFile "));

      offset = 0;

      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        uint8_t* _pointer = (uint8_t *) myMenuItems[i].pdata;

        ESP_AT_LOGDEBUG3(F("CW2:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);

        if (file)
        {
          fseek(file, offset, SEEK_SET);
          fwrite(_pointer, 1, myMenuItems[i].maxlen, file);

          // Redundant, but to be sure correct position
          offset += myMenuItems[i].maxlen;
        }
        else
        {
          ESP_AT_LOGDEBUG(F("failed"));
        }

        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++, _pointer++)
        {
          checkSum += *_pointer;
        }
      }

      if (file)
      {
        fwrite((uint8_t *) &checkSum, 1, sizeof(checkSum), file);
        fclose(file);

        ESP_AT_LOGDEBUG(F("OK"));
      }
      else
      {
        ESP_AT_LOGDEBUG(F("failed"));
      }
    }

#endif

    //////////////////////////////////////////////

    void NULLTerminateConfig()
    {
      //#define HEADER_MAX_LEN      16
      //#define BOARD_NAME_MAX_LEN  24

      // NULL Terminating to be sure
      ESP8266_AT_config.header    [HEADER_MAX_LEN - 1]      = 0;
      ESP8266_AT_config.board_name[BOARD_NAME_MAX_LEN - 1]  = 0;

      // For WiFi SSID/PWD here
      for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
      {
        ESP8266_AT_config.WiFi_Creds[i].wifi_ssid[SSID_MAX_LEN - 1] = 0;
        ESP8266_AT_config.WiFi_Creds[i].wifi_pw  [PASS_MAX_LEN - 1] = 0;
      }
    }

    //////////////////////////////////////////////

    bool isWiFiConfigValid()
    {
#if REQUIRE_ONE_SET_SSID_PW

      // If SSID ="blank" or NULL, or PWD length < 8 (as required by standard) => return false
      // Only need 1 set of valid SSID/PWD
      if (!( ( ( strncmp(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid, WM_NO_CONFIG, strlen(WM_NO_CONFIG)) &&
                 strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid) >  0 )  &&
               (   strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_pw) >= PASSWORD_MIN_LEN ) ) ||
             ( ( strncmp(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid, WM_NO_CONFIG, strlen(WM_NO_CONFIG)) &&
                 strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid) >  0 )  &&
               ( strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_pw) >= PASSWORD_MIN_LEN ) ) ))
#else

      // If SSID ="blank" or NULL, or PWD length < 8 (as required by standard) => invalid set
      // Need both sets of valid SSID/PWD
      if ( !strncmp(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid,   WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
           !strncmp(ESP8266_AT_config.WiFi_Creds[0].wifi_pw,     WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
           !strncmp(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid,   WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
           !strncmp(ESP8266_AT_config.WiFi_Creds[1].wifi_pw,     WM_NO_CONFIG, strlen(WM_NO_CONFIG) )  ||
           ( strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid) == 0 ) ||
           ( strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid) == 0 ) ||
           ( strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_pw)   < PASSWORD_MIN_LEN ) ||
           ( strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_pw)   < PASSWORD_MIN_LEN ) )
#endif
      {
        ESP_AT_LOGERROR(F("Invalid Stored WiFi Config Data."));

        // Nullify the invalid data to avoid displaying garbage
        memset(&ESP8266_AT_config, 0, sizeof(ESP8266_AT_config));

        // If SSID, PW ="blank" or NULL, or PPWD len < 8, set the flag
        if ( ( strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_pw) < PASSWORD_MIN_LEN ) ||
             ( strlen(ESP8266_AT_config.WiFi_Creds[1].wifi_pw) < PASSWORD_MIN_LEN ) )
        {
          ESP_AT_LOGERROR(F("WiFi PWD len < 8"));
        }
        else
        {
          ESP_AT_LOGERROR(F("SSID is blank or NULL"));
        }

