khoih-prog/ESP_AT_WM_Lite/src/Esp8266_AT_WM_Lite_Mbed_RPi_Pico.h
        hadConfigData = false;

        return false;
      }

      return true;
    }

    //////////////////////////////////////////////

    bool loadConfigData()
    {
      ESP_AT_LOGWARN(F("LoadCfgFile "));

      // file existed
      FILE *file = fopen(CONFIG_FILENAME, "r");

      if (!file)
      {
        ESP_AT_LOGWARN(F("failed"));

        // Trying open redundant config file
        file = fopen(CONFIG_FILENAME_BACKUP, "r");

        ESP_AT_LOGWARN(F("LoadBkUpCfgFile "));

        if (!file)
        {
          ESP_AT_LOGWARN(F("failed"));
          return false;
        }
      }

      fseek(file, 0, SEEK_SET);
      fread((uint8_t *) &ESP8266_AT_config, 1, sizeof(ESP8266_AT_config), file);
      fclose(file);

      ESP_AT_LOGWARN(F("OK"));

      NULLTerminateConfig();

      return isWiFiConfigValid();
    }

    //////////////////////////////////////////////

    void saveConfigData()
    {
      ESP_AT_LOGWARN(F("SaveCfgFile "));

      int calChecksum = calcChecksum();
      ESP8266_AT_config.checkSum = calChecksum;
      ESP_AT_LOGWARN1(F("WCSum=0x"), String(calChecksum, HEX));

      // file existed
      FILE *file = fopen(CONFIG_FILENAME, "w");

      if (file)
      {
        fseek(file, 0, SEEK_SET);
        fwrite((uint8_t *) &ESP8266_AT_config, 1, sizeof(ESP8266_AT_config), file);
        fclose(file);

        ESP_AT_LOGWARN(F("OK"));
      }
      else
      {
        ESP_AT_LOGWARN(F("failed"));
      }

      ESP_AT_LOGWARN(F("SaveBkUpCfgFile "));

      // Trying open redundant Auth file
      file = fopen(CONFIG_FILENAME_BACKUP, "w");

      if (file)
      {
        fseek(file, 0, SEEK_SET);
        fwrite((uint8_t *) &ESP8266_AT_config, 1, sizeof(ESP8266_AT_config), file);
        fclose(file);

        ESP_AT_LOGWARN(F("OK"));
      }
      else
      {
        ESP_AT_LOGWARN(F("failed"));
      }

#if USE_DYNAMIC_PARAMETERS
      saveDynamicData();
#endif
    }

    //////////////////////////////////////////////
    // New from v1.0.4
    void loadAndSaveDefaultConfigData()
    {
      // Load Default Config Data from Sketch
      memcpy(&ESP8266_AT_config, &defaultConfig, sizeof(ESP8266_AT_config));
      strcpy(ESP8266_AT_config.header, ESP_AT_BOARD_TYPE);

      // Including config and dynamic data, and assume valid
      saveConfigData();

      ESP_AT_LOGWARN(F("======= Start Loaded Config Data ======="));
      displayConfigData(ESP8266_AT_config);
    }

    //////////////////////////////////////////////

    // Return false if init new EEPROM or SPIFFS. No more need trying to connect. Go directly to config mode
    bool getConfigData()
    {
      bool dynamicDataValid = true;
      int calChecksum;

      hadConfigData = false;

      // Use new LOAD_DEFAULT_CONFIG_DATA logic
      if (LOAD_DEFAULT_CONFIG_DATA)
      {
        // Load Config Data from Sketch
        loadAndSaveDefaultConfigData();

        // Don't need Config Portal anymore
        return true;
      }
      else
      {
        // Load stored config data from LittleFS
        // If WiFi SSID/PWD "blank" or NULL, or PWD len < 8, set false flag and exit
        if (!loadConfigData())
        {
          return false;
        }

        calChecksum = calcChecksum();

        ESP_AT_LOGWARN3(F("CCSum=0x"), String(calChecksum, HEX), F(",RCSum=0x"), String(ESP8266_AT_config.checkSum, HEX));

#if USE_DYNAMIC_PARAMETERS
        // Load stored dynamic data from LittleFS
        dynamicDataValid = checkDynamicData();
#endif

        // If checksum = 0 => LittleFS has been cleared (by uploading new FW, etc) => force to CP
        // If bad checksum = 0 => force to CP
        if ( (calChecksum != 0) && (calChecksum == ESP8266_AT_config.checkSum) )
        {
          if (dynamicDataValid)
          {
#if USE_DYNAMIC_PARAMETERS
            loadDynamicData();

            ESP_AT_LOGWARN(F("Valid Stored Dynamic Data"));
#endif

            ESP_AT_LOGWARN(F("======= Start Stored Config Data ======="));
            displayConfigData(ESP8266_AT_config);

            // Don't need Config Portal anymore
            return true;
          }
          else
          {
            // Invalid Stored config data => Config Portal
            ESP_AT_LOGWARN(F("Invalid Stored Dynamic Data. Load default from Sketch"));

            // Load Default Config Data from Sketch, better than just "blank"
            loadAndSaveDefaultConfigData();

            // Need Config Portal here as data can be just dummy
            // Even if you don't open CP, you're OK on next boot if your default config data is valid
            return false;
          }
        }
      }

      if ( (strncmp(ESP8266_AT_config.header, ESP_AT_BOARD_TYPE, strlen(ESP_AT_BOARD_TYPE)) != 0) ||
           (calChecksum != ESP8266_AT_config.checkSum) || !dynamicDataValid )
      {
        // Including Credentials CSum
        ESP_AT_LOGWARN1(F("InitCfgDat,sz="), sizeof(ESP8266_AT_config));

        // doesn't have any configuration
        if (LOAD_DEFAULT_CONFIG_DATA)
        {
          memcpy(&ESP8266_AT_config, &defaultConfig, sizeof(ESP8266_AT_config));
        }
        else
        {
          memset(&ESP8266_AT_config, 0, sizeof(ESP8266_AT_config));

#if USE_DYNAMIC_PARAMETERS

          for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
          {
            // Actual size of pdata is [maxlen + 1]
            memset(myMenuItems[i].pdata, 0, myMenuItems[i].maxlen + 1);
          }

#endif

          strcpy(ESP8266_AT_config.WiFi_Creds[0].wifi_ssid,   WM_NO_CONFIG);
          strcpy(ESP8266_AT_config.WiFi_Creds[0].wifi_pw,     WM_NO_CONFIG);
          strcpy(ESP8266_AT_config.WiFi_Creds[1].wifi_ssid,   WM_NO_CONFIG);
          strcpy(ESP8266_AT_config.WiFi_Creds[1].wifi_pw,     WM_NO_CONFIG);
          strcpy(ESP8266_AT_config.board_name, DEFAULT_BOARD_NAME);

#if USE_DYNAMIC_PARAMETERS

          for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
          {
            strncpy(myMenuItems[i].pdata, WM_NO_CONFIG, myMenuItems[i].maxlen);
          }

#endif
        }

