khoih-prog/ESP_AT_WM_Lite/src/Esp8266_AT_WM_Lite_Mbed_RPi_Pico.h
        strcpy(ESP8266_AT_config.header, ESP_AT_BOARD_TYPE);

#if USE_DYNAMIC_PARAMETERS

        for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
        {
          ESP_AT_LOGDEBUG3(F("g:myMenuItems["), i, F("]="), myMenuItems[i].pdata );
        }

#endif

        // Don't need
        ESP8266_AT_config.checkSum = 0;

        saveConfigData();

        return false;
      }
      else if ( !isWiFiConfigValid() )
      {
        // If SSID, PW ="blank" or NULL, stay in config mode forever until having config Data.
        return false;
      }
      else
      {
        displayConfigData(ESP8266_AT_config);
      }

      return true;
    }

    //////////////////////////////////////////////

    // Max times to try WiFi per loop() iteration. To avoid blocking issue in loop()
    // Default 1 and minimum 1.
#if !defined(MAX_NUM_WIFI_RECON_TRIES_PER_LOOP)
#define MAX_NUM_WIFI_RECON_TRIES_PER_LOOP     1
#else
#if (MAX_NUM_WIFI_RECON_TRIES_PER_LOOP < 1)
#define MAX_NUM_WIFI_RECON_TRIES_PER_LOOP     1
#endif
#endif

    // New connection logic from v1.2.0
    bool connectMultiWiFi(int retry_time)
    {
      int sleep_time  = 250;
      int index       = 0;
      int new_index   = 0;
      uint8_t status  = WL_IDLE_STATUS;

      static int lastConnectedIndex = 255;

      ESP_AT_LOGDEBUG(F("ConMultiWifi"));

      if (static_IP != IPAddress(0, 0, 0, 0))
      {
        ESP_AT_LOGDEBUG(F("UseStatIP"));
        WiFi.config(static_IP);
      }

      if (lastConnectedIndex != 255)
      {
        //  Successive connection, index = ??
        // Checking if new_index is OK
        new_index = (lastConnectedIndex + 1) % NUM_WIFI_CREDENTIALS;

        if ( strlen(ESP8266_AT_config.WiFi_Creds[new_index].wifi_pw) >= PASSWORD_MIN_LEN )
        {
          index = new_index;
          ESP_AT_LOGDEBUG3(F("Using index="), index, F(", lastConnectedIndex="), lastConnectedIndex);
        }
        else
        {
          ESP_AT_LOGERROR3(F("Ignore invalid WiFi PW : index="), new_index, F(", PW="),
                           ESP8266_AT_config.WiFi_Creds[new_index].wifi_pw);

          // Using the previous valid index
          index = lastConnectedIndex;
        }
      }
      else
      {
        //  First connection ever, index = 0
        if ( strlen(ESP8266_AT_config.WiFi_Creds[0].wifi_pw) >= PASSWORD_MIN_LEN )
        {
          ESP_AT_LOGDEBUG(F("First connection, Using index=0"));
        }
        else
        {
          ESP_AT_LOGERROR3(F("Ignore invalid WiFi PW : index=0, SSID="), ESP8266_AT_config.WiFi_Creds[0].wifi_ssid,
                           F(", PWD="), ESP8266_AT_config.WiFi_Creds[0].wifi_pw);

          // Using the next valid index
          index = 1;
        }
      }

      ESP_AT_LOGERROR3(F("con2WF:SSID="), ESP8266_AT_config.WiFi_Creds[index].wifi_ssid,
                       F(",PW="), ESP8266_AT_config.WiFi_Creds[index].wifi_pw);

      uint8_t numIndexTried = 0;

      uint8_t numWiFiReconTries = 0;

      while ( !wifi_connected && (numIndexTried++ < NUM_WIFI_CREDENTIALS)
              && (numWiFiReconTries++ < MAX_NUM_WIFI_RECON_TRIES_PER_LOOP) )
      {
        while ( 0 < retry_time )
        {
          ESP_AT_LOGDEBUG1(F("Remaining retry_time="), retry_time);

          status = WiFi.begin(ESP8266_AT_config.WiFi_Creds[index].wifi_ssid, ESP8266_AT_config.WiFi_Creds[index].wifi_pw);

          // Need restart WiFi at beginning of each cycle
          if (status == WL_CONNECTED)
          {
            wifi_connected = true;
            lastConnectedIndex = index;
            ESP_AT_LOGDEBUG1(F("WOK, lastConnectedIndex="), lastConnectedIndex);

            break;
          }
          else
          {
            delay(sleep_time);
            retry_time--;
          }
        }

        if (status == WL_CONNECTED)
        {
          break;
        }
        else
        {
          if (retry_time <= 0)
          {
            ESP_AT_LOGERROR3(F("Failed using index="), index, F(", retry_time="), retry_time);
            retry_time = RETRY_TIMES_CONNECT_WIFI;
          }

          new_index = (index + 1) % NUM_WIFI_CREDENTIALS;

          // only use new index if valid (len >= PASSWORD_MIN_LEN = 8)
          if ( strlen(ESP8266_AT_config.WiFi_Creds[new_index].wifi_pw) >= PASSWORD_MIN_LEN )
          {
            index = new_index;
          }

          //WiFi.end();
        }
      }

      if (wifi_connected)
      {
        ESP_AT_LOGERROR(F("con2WF:OK"));

        ESP_AT_LOGERROR1(F("IP="), WiFi.localIP() );

        displayWiFiData();
      }
      else
      {
        ESP_AT_LOGERROR(F("con2WF:failed"));
        // Can't connect, so try another index next time. Faking this index is OK and lost
        lastConnectedIndex = index;
      }

      return wifi_connected;
    }

    //////////////////////////////////////////////

    // NEW
    void createHTML(String& root_html_template)
    {
      String pitem;

      root_html_template  = ESP_AT_HTML_HEAD_START;

#if USING_CUSTOMS_STYLE

      // Using Customs style when not NULL
      if (ESP_AT_HTML_HEAD_CUSTOMS_STYLE)
        root_html_template  += ESP_AT_HTML_HEAD_CUSTOMS_STYLE;
      else
        root_html_template  += ESP_AT_HTML_HEAD_STYLE;

#else
      root_html_template  += ESP_AT_HTML_HEAD_STYLE;
#endif

#if USING_CUSTOMS_HEAD_ELEMENT

      if (_CustomsHeadElement)
        root_html_template += _CustomsHeadElement;

#endif

#if SCAN_WIFI_NETWORKS
      ESP_AT_LOGDEBUG1(WiFiNetworksFound, F(" SSIDs found, generating HTML now"));
      // Replace HTML <input...> with <select...>, based on WiFi network scan in startConfigurationMode()

      ListOfSSIDs = "";

      for (int i = 0, list_items = 0; (i < WiFiNetworksFound) && (list_items < MAX_SSID_IN_LIST); i++)
      {
        if (indices[i] == -1)
          continue;     // skip duplicates and those that are below the required quality

        ListOfSSIDs += WM_OPTION_START + String(WiFi.SSID(indices[i])) + WM_OPTION_END;
        list_items++;   // Count number of suitable, distinct SSIDs to be included in list
      }

      ESP_AT_LOGDEBUG(ListOfSSIDs);

      if (ListOfSSIDs == "")    // No SSID found or none was good enough
        ListOfSSIDs = WM_OPTION_START + String(WM_NO_NETWORKS_FOUND) + WM_OPTION_END;

